/******************************************************************************
 * 剩余参数
 *     - ES6 引入了 rest 参数（形式为 ...变量名），允许函数从多个位置获取参数。
 *     - rest 参数用于获取函数的剩余参数，这些参数以数组的形式存放。
 *     - 剩余参数的语法是 ...变量名，它将所有参数收集到一个数组中。
 ******************************************************************************/
function show(...args) {
    console.log(args);
}

show(1, 2, 3);  // [ 1, 2, 3 ]
show(); // []


// 一个固定参数和 剩余参数
function display(x, ...args) {
    console.log(x, "；", args);
}

display(1, 2, 3, 4, 5); // 1； [ 2, 3, 4, 5 ]
display(1); // 1； []


// -----------------------------------------------------------------------------
// 剩余参数的过滤
// -----------------------------------------------------------------------------
function sum(...args) {
    return args.filter(e => typeof e === "number").reduce((pre, cur) => pre + cur);
}

console.log(sum(1, 2, 3, "4", 5, "6", undefined, 10));  // 21

// 动态函数使用剩余参数情况
const fn = new Function("...args", "console.log(args)");
fn(1, 3, 5);    // [ 1, 3, 5 ]