/***************************************************************************
 * 对象类型数字运算
 *   - toString
 *   - valueOf
 * + 数字类型转换操作
 ***************************************************************************/

let price = {
    valueOf() {
        return 5;
    },
    toString() {
        return 'price';
    }
};

// --------------------------------------------------------------------
// 优先使用 valueOf 进行运算
// --------------------------------------------------------------------
console.log(price + 10);    // 15
console.log(price - 10);    // -5

let amount = {
    toString() {
        return 20;
    }
};


// --------------------------------------------------------------------
// 没有valueOf时，toString 也可以进行运算
// --------------------------------------------------------------------
console.log(amount + 10);   // 30
console.log(amount - 10);   // 10


// --------------------------------------------------------------------
// + 运算符进行数字类型转换
// --------------------------------------------------------------------
const num = '666';
console.log(+num);  // 666
console.log(typeof +num);   // number

const flag = true, bool = false;
console.log(+flag);  // 1
console.log(+bool);  // 0
console.log(typeof +flag);  // number

const age = {
    toString() {
        return '22';
    }
};

console.log(+age);  // 22