/******************************************************************************
 * 立即执行的函数
 *****************************************************************************/
// 立即执行的函数
let sum = (function (a, b) {
    return a + b;
})(1, 2);

console.log(sum);

// 立即执行的函数，带参数
(function (a, b) {
    console.log(a + b);
})(1, 2);

// 立即执行的函数，不带参数
(function () {
    console.log('hello');
})();

// 立即执行的函数，箭头函数; 添加 分号 开头防止多文件合并出现错误
;(() => {
    // 函数中的变量声明，会提升到函数作用域中，避免污染全局作用域
    var a = 1;
    let b = 2;

    console.log('hello', a + b);
})();