/********************************************************************************
 * 函数回调
 *     - 函数作为参数传递给另一个函数，并作为返回值返回
 ********************************************************************************/
function filter(callback, ...args) {
    let result = [];
    for (let i = 0; i < args.length; i++) {
        if (callback(args[i])) {
            result.push(args[i]);
        }
    }

    return result;
}

console.log(filter(function (item) {
    if (item % 2 === 0) {
        return true;
    }
}, 1, 2, 3, 4, 5)); // [2, 4]

console.log(filter(function (item) {
    return item > 3;
}, 1, 2, 3, 4, 5)); // [4, 5]

/********************************************************************************
 * 函数作为参数传递给另一个函数
 ********************************************************************************/
function isOdd(item) {
    return item % 2 === 0;
}

console.log(filter(isOdd, 1, 2, 3, 4, 5));  // [2, 4]


// -----------------------------------------------------------------------------
// 箭头函数作为回调函数
// -----------------------------------------------------------------------------
console.log(filter(item => item % 2 === 0, 1, 2, 3, 4, 5));
